#!/bin/bash


###############################################################
# ** 保存用ディレクトリ作成
###############################################################
dir=pic; [ ! -e $dir ] && mkdir -p $dir

###############################################################
# ** 引数の設定
###############################################################
NSTART=0 # 読み込み開始数
NFILES=`find $OUTPUT_DIR -name "*[0-9]*.dat" | wc -l` # ディレクトリ中のファイル数取得
DELAY=2 # gif画像のコマ送りスピード(大きいほど遅い　5の場合は1秒間に20枚の画像更新)

###############################################################
# ** 読み込み先，画像格納先の指定
###############################################################
OUTPUT_DIR="result/" # 結果ディレクトリの指定
BINARY_FLG=0 # バイナリファイルであるときはtrueで
DATADIR="DATADIR='result/'" # 読み込み元フォルダ
PICDIR="PICDIR='pic/'" # 格納先フォルダ
SCRIPT="${DATADIR};${PICDIR}"

###############################################################
# ** 粒子位置の時間変化gif作成
###############################################################
if [ $BINARY_FLG -eq 1 ]; then
  gnuplot -e $SCRIPT -c gp/pos_binary.gp $NSTART $NFILES $DELAY
else
  gnuplot -e $SCRIPT -c gp/pos.gp $NSTART $NFILES $DELAY
fi

###############################################################
# ** エネルギー時間変化作成
###############################################################
gnuplot -e $SCRIPT -c gp/energy.gp

###############################################################
# ** エネルギー誤差変化作成
###############################################################
gnuplot -e $SCRIPT -c gp/energy_err.gp
